<div class="comname">เกี่ยวกับเรา</div>
<br>
เครื่องมือแพทย์มีส่วนสำคัญในการปฏิบัติงานของแพทย์เพื่อรักษาผู้ป่วย ทั้งยังช่วยให้แพทย์ทำงานได้ง่ายขึ้น มีทั้งแบบที่ใช้ในการปฏิบัติงาน ณ ขณะนั้น และแบบแสดงผลตรวจร่างกายแบบต่อเนื่องเป็นระยะเวลานาน ซึ่งแพทย์หรือพยาบาลไม่สามารถทำได้ทั้งหมด อีกทั้งยังประหยัดทรัพยากรบุคคลได้ด้วย<br>
<br>
 เพื่อความปลอดภัยของผู้ป่วยเครื่องมือแพทย์ทุกชนิดจึงต้องมีความเที่ยงตรงแม่นยำในการวัดหรือการใช้งานในทุกรูปแบบ ตามมาตรฐานสากล จึงจำเป็นต้องมีการสอบเทียบเพื่อตรวจวัดค่าต่างๆตามลักษณะการใช้งานว่าเครื่องมือแพทย์นั้นๆ ผ่านเกณฑ์มาตรฐานหรือไม่ ก่อนนำไปใช้งานกับผู้ป่วย และเครื่องมือแพทย์ทุกชิ้น จำเป็นต้องสอบเทียบอย่างน้อยหนึ่งครั้งต่อปี (แล้วแต่ชนิดของเครื่องและลักษณะการใช้งานของเครื่องนั้นๆ)<br>
<br>
 บริษัท ไอโซเทค อินสตรูเมนท์ (ประเทศไทย) จำกัด เปิดให้บริการสอบเทียบค่ามาตรฐานเครื่องมือแพทย์ และเครื่องมือสอบเทียบ (โดยเครื่องมือสอบเทียบจะส่งไปต่างประเทศ) โดยได้รับมาตรฐานการสอบเทียบที่ถูกต้อง และบริษัทยังจำหน่ายเครื่องมือสอบเทียบด้วย ซึ่งเป็นผลิตภัณฑ์ของ Fluke ประเทศสหรัฐอเมริกา แต่เพียงรายเดียวในประเทศไทย ท่านสามารถดูบริการทั้งหมดได้ที่เมนู Service และสินค้าที่เมนู Product