เครื่องวิเคราะห์เครื่องกระตุกหัวใจ รุ่น DA-2006 มี Feature หลักๆดังนี้<br>
• มีการแสดงผลหน้าจอ Backlight แบบหลายพารามิเตอร์<br>
• แสดงผล Waveform ของ Defibrillator และ Pacemaker บนหน้าจอ<br>
• สามารถทดสอบทั้งแบบ Monophasic และ Biphasic<br>
• รองรับการทดสอบสูงสุด 5000 โวลต์, 1000 จูลล์<br>
• สามารถวัด Cardioversion delay<br>
• สามารถวัด Charge time<br>
• บันทึก Waveform ได้<br>
• การเชื่อมต่อ ECG แบบ 12 lead<br>
• สามารถจำลองสัญญาณ ECG แบบปกติ และผิดปกติได้<br>
• เชื่อมต่อ Printer ด้วยพาราเรลพอร์ท<br>
• ทำงานด้วยแบตเตอรี่ 9V และมีไฟแสดงสถานะเมื่อแบตเตอรี่ต่ำ<br>
• สามารถทดสอบแบบ Auto sequence