เครื่องวัดอัตราการไหลของแกส รุ่น Defender 530+ มี Feature หลักๆดังนี้<br>
• ออกแบบมาเพื่อใช้งานด้านอุตสาหกรรมโดยเฉพาะ<br>
• สามารถวัดอัตราการไหลของแกสได้ตั้งแต่ 5ml/min ถึง 30 LPM (แล้วแต่รุ่น)<br>
• ขนาดเล็ก พกพาสะดวก<br>
• มีแบตเตอรี่ภายในสามารถชาร์จได้<br>
• ค่า Accuracy ± 1% ของค่าที่อ่านได้<br>
• มี Self Test เพื่อตรวจสอบการรั่วไหล<br>
• มีระบบการวัดทั้งแบบ Single, Burst และ Continuous<br>
• สามารถวัด Ambient Temperature และ Pressure ได้<br>
• ใช้งานด้วย Battery ในตัวและสามารถชาร์จได้<br>
• ใช้งานร่วมกับ Software ได้