เครื่องวิเคราะห์การทำงานของ Infusion Pump รุ่น IPA-3400 มี Feature หลักๆดังนี้<br>
• ตัวเครื่องขนาดเล็ก ใช้งานง่าย สะดวก รวดเร็ว<br>
• มีความแม่นยำสูง<br>
• หน้าจอสัมผัสขนาดใหญ่ถึง 7 นิ้ว<br>
• สามารถเลือก เพิ่ม/ลด สลับ แชนแนล เองได้ตั้งแต่ 1-4 แชนแนล<br>
• มีระบบ Auto Start<br>
• มี Auto Sequences ในตัว<br>
• บันทึกผลได้ในตัว<br>
• รองรับการปฏิบัติตามมาตรฐาน IEC 60601-2-24<br>
• ช่วงการวัด 10μL ถึง 1,000 mL/Hr<br>
• มี 4 USB Ports และ 4 AUX Ports รองรับการใช้งานกับ Flash Drives, Barcode Scanners, Keyboard และ Mouse<br>
• ใช้งานร่วมกับคอมพิวเตอร์ได้<br>
• มีหน่วยแรงดัน mmHg, PSI, Bar, kPa<br>
• หน่วยความจำในตัวเครื่อง 32GB