เครื่องวิเคราะห์ความปลอดภัยทางไฟฟ้า รุ่น SA-2001 เป็นหนึ่งใน SA-2000 Series โดยมี Feature หลักๆดังนี้<br>
<br>
• ตัวเครื่องมีขนาดที่เล็ก พกพาสะดวก<br>
• สามารถวัดแรงดันและกระแสไฟฟ้าแบบ True RMS<br>
• สามารถการวัดความต้านทานสายดินและกระแสรั่วไหล Earth Leakage Current<br>
• สามารถทำการวัดแบบ Point-to-Point (บางรุ่น)<br>
• สามารถวัดกระแสรั่วไหลจากตัวถัง<br>
• สามารถวัดความต้านและกระแสรั่วไหลภายนอก<br>
• ตรวจสอบความสมบูรณ์ของแหล่งจ่ายไฟ<br>
• MAP (Isolation) Function<br>
• สามารถจำลองสัญญาณ ECG ได้ (บางรุ่น)<br>
• การเลือก Load สำหรับมาตรฐาน AAMI ES1-1993 หรือ IEC 601 (เฉพาะรุ่น 2001 ขึ้นไป)<br>
• ใช้งานกับแรงดัน 85 to 265 VAC<br>
• รองรับกระแสสูงสุด 20 แอมป์<br>
• ควบคุมด้วยปุ่มสัมผัส<br>
• มีไฟแสดงสถานะ LED<br>
• การตอบสนองด้วยเสียง<br>
• มีจุดทำหรับ Self-Test (บางรุ่น)<br>
• จุดเปลี่ยน Fuse ภายนอกเครื่อง<br>
• Automatic Load Reversal Delay