TD-03 เป็นตู้ทำความร้อนระบบปิด สามารถตั้งอุณหภูมิได้ตั้งแต่ 5 °C
เหนืออุณภูมิห้อง ถึง 80 °C เหมาะสำหรับใช้งานให้ความร้อนอบแห้งสายยาง
สายเครื่องช่วยหายใจ หรืออุปกรณ์อื่นๆ
ที่ต้องการทำให้แห้งด้วยความร้อนอย่างรวดเร็วยิ่งขึ้นกว่าการปล่อยให้แห้งตามปกติ
ผ่านการสอบเทียบอุณหภูมิ และทดสอบความปลอดภัยทางไฟฟ้าตามมาตรฐาน IEC 60601-1<br />
<br />
<br />
คุณสมบัติทั่วไป<br />
• เป็นเครื่องสำหรับอบแห้ง สายยาง สายเครื่องช่วยหายใจ ขนาด 600 ลิตร<br />
• สามารถอบแห้งสายตั้งแต่ขนาดเล็กจนถึงสายสำหรับ เครื่องช่วยหายใจ เครื่องดมยาสลบ
อุปกรณ์<br />
• เครื่องช่วยหายใจและอุปกรณ์อื่น ๆ ได้พร้อมกันถึง 80 เส้น โดยใช้ความร้อน<br />
• สามารถปรับอุณหภูมิได้ตั้งแต่เหนืออุณหภูมิห้อง 5 °C ถึง 80 °C
พร้อมระบบควบคุมอุณหภูมิให้คงที่ ด้วย ไมโครโปรเซสเซอร์ <br />
• สามารถใช้งานได้ทั้งแบบกำหนดเวลา (Automatic) แบบต่อเนื่อง (Manual)<br />
• เป็นผลิตภัณฑ์ ISOTECH ประเทศไทย รับประกัน 1 ปี
