WS-02 เป็นตู้ทำความร้อนระบบปิด สามารถตั้งอุณหภูมิได้ตั้งแต่ 5 °C
เหนืออุณภูมิห้อง ถึง 60 °C เหมาะสำหรับใช้งานอุ่นสารละลาย (น้ำเกลือ)
เพื่อใช้ในกิจกรรมทางการแพทย์ เพื่อให้สะดวกต่อการนำมาใช้
โดยรักษาอุณหภูมิให้คงที่พร้อมใช้เสมอ ตัวเครื่องผ่านการสอบเทียบอุณหภูมิ
และทดสอบความปลอดภัยทางไฟฟ้าตามมาตรฐาน IEC 60601-1<br />
<br />
<br />
คุณสมบัติทั่วไป<br />
• เป็นเครื่องสำหรับอุ่นสารละลาย ได้ครั้งละไม่น้อยกว่า 30 ขวด โดยใช้ความร้อน
<br />
• สามารถปรับอุณหภูมิได้ตั้งแต่เหนืออุณหภูมิห้อง 5 °C ถึง 60 °C
พร้อมระบบควบคุมอุณหภูมิให้คงที่ด้วยไมโครโปรเซสเซอร์ <br />
• สามารถใช้งานได้ทั้งแบบกำหนดเวลา (Automatic) แบบต่อเนื่อง (Manual)<br />
• เป็นผลิตภัณฑ์ ISOTECH ประเทศไทย รับประกัน 1 ปี
