ตู้อุ่นน้ำเกลือ รุ่น WSC ประกอบด้วย 4 ขนาด คือ<br />
WSC-01 : 70 ขวด<br />
WSC-02 : 30 ขวด<br />
WSC-03 : 150 ขวด<br />
<br />
เป็นตู้ทำความร้อนระบบปิด สามารถตั้งอุณหภูมิได้ตั้งแต่ 5 °C เหนืออุณภูมิห้อง ถึง
60 °C เหมาะสำหรับใช้งานอุ่นสารละลาย (น้ำเกลือ) เพื่อใช้ในกิจกรรมทางการแพทย์
เพื่อให้สะดวกต่อการนำมาใช้ โดยรักษาอุณหภูมิให้คงที่พร้อมใช้เสมอ
ตัวเครื่องผ่านการสอบเทียบอุณหภูมิ และทดสอบความปลอดภัยทางไฟฟ้าตามมาตรฐาน IEC
60601-1<br />
<br />
คุณสมบัติทั่วไป<br />
• เป็นเครื่องสำหรับอุ่นสารละลายโดยใช้ความร้อน <br />
• สามารถปรับอุณหภูมิได้ตั้งแต่เหนืออุณหภูมิห้อง 5 °C ถึง 60 °C
พร้อมระบบควบคุมอุณหภูมิให้คงที่ด้วยไมโครโปรเซสเซอร์ <br />
• สามารถใช้งานได้ทั้งแบบกำหนดเวลา เปิด-ปิด อัตโนมัติ (Automatic) และ
แบบต่อเนื่อง (Manual)<br />
• มีไฟแสดงสถานะการทำงานของฮีทเตอร์<br />
• เป็นผลิตภัณฑ์ ISOTECH ประเทศไทย รับประกัน 1 ปี
